In [1]:
import pandas as pd

In [2]:
df_gun = pd.read_csv('gun_data.csv')

In [3]:
df_gun.head(5)

,month,state,permit,permit_recheck,handgun,long_gun,other,multiple,admin,prepawn_handgun,...,returned_other,rentals_handgun,rentals_long_gun,private_sale_handgun,private_sale_long_gun,private_sale_other,return_to_seller_handgun,return_to_seller_long_gun,return_to_seller_other,totals
0,2017-09,Alabama,16717.0,0.0,5734.0,6320.0,221.0,317,0.0,15.0,...,0.0,0.0,0.0,9.0,16.0,3.0,0.0,0.0,3.0,32019
1,2017-09,Alaska,209.0,2.0,2320.0,2930.0,219.0,160,0.0,5.0,...,0.0,0.0,0.0,17.0,24.0,1.0,0.0,0.0,0.0,6303
2,2017-09,Arizona,5069.0,382.0,11063.0,7946.0,920.0,631,0.0,13.0,...,0.0,0.0,0.0,38.0,12.0,2.0,0.0,0.0,0.0,28394
3,2017-09,Arkansas,2935.0,632.0,4347.0,6063.0,165.0,366,51.0,12.0,...,0.0,0.0,0.0,13.0,23.0,0.0,0.0,2.0,1.0,17747
4,2017-09,California,57839.0,0.0,37165.0,24581.0,2984.0,0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,123506

In [4]:
df_gun.tail(5)

,month,state,permit,permit_recheck,handgun,long_gun,other,multiple,admin,prepawn_handgun,...,returned_other,rentals_handgun,rentals_long_gun,private_sale_handgun,private_sale_long_gun,private_sale_other,return_to_seller_handgun,return_to_seller_long_gun,return_to_seller_other,totals
12480,1998-11,Virginia,0.0,NaN,14.0,2.0,NaN,8,0.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,24
12481,1998-11,Washington,1.0,NaN,65.0,286.0,NaN,8,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,361
12482,1998-11,West Virginia,3.0,NaN,149.0,251.0,NaN,5,0.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,408
12483,1998-11,Wisconsin,0.0,NaN,25.0,214.0,NaN,2,0.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,241
12484,1998-11,Wyoming,8.0,NaN,45.0,49.0,NaN,5,0.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,107

In [5]:
df_gun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12485 entries, 0 to 12484
Data columns (total 27 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   month                      12485 non-null  object
 1   state                      12485 non-null  object
 2   permit                     12461 non-null  float64
 3   permit_recheck             1100 non-null   float64
 4   handgun                    12465 non-null  float64
 5   long_gun                   12466 non-null  float64
 6   other                      5500 non-null   float64
 7   multiple                   12485 non-null  int64
 8   admin                      12462 non-null  float64
 9   prepawn_handgun            10542 non-null  float64
 10  prepawn_long_gun           10540 non-null  float64
 11  prepawn_other              5115 non-null   float64
 12  redemption_handgun         10545 non-null  float64
 13  redemption_long_gun        10544 non-null  float64
 14  redemption_other           5115 non-null   float64
 15  returned_handgun           2200 non-null   float64
 16  returned_long_gun          2145 non-null   float64
 17  returned_other             1815 non-null   float64
 18  rentals_handgun            990 non-null    float64
 19  rentals_long_gun           825 non-null    float64
 20  private_sale_handgun       2750 non-null   float64
 21  private_sale_long_gun      2750 non-null   float64
 22  private_sale_other         2750 non-null   float64
 23  return_to_seller_handgun   2475 non-null   float64
 24  return_to_seller_long_gun  2750 non-null   float64
 25  return_to_seller_other     2255 non-null   float64
 26  totals                     12485 non-null  int64
dtypes: float64(23), int64(2), object(2)
memory usage: 2.6+ MB

In [6]:
df_gun.describe()

,permit,permit_recheck,handgun,long_gun,other,multiple,admin,prepawn_handgun,prepawn_long_gun,prepawn_other,...,returned_other,rentals_handgun,rentals_long_gun,private_sale_handgun,private_sale_long_gun,private_sale_other,return_to_seller_handgun,return_to_seller_long_gun,return_to_seller_other,totals
count,12461.000000,1100.000000,12465.000000,12466.000000,5500.000000,12485.000000,12462.000000,10542.000000,10540.000000,5115.000000,...,1815.000000,990.000000,825.000000,2750.000000,2750.000000,2750.000000,2475.000000,2750.000000,2255.000000,12485.000000
mean,6413.629404,1165.956364,5940.881107,7810.847585,360.471636,268.603364,58.898090,4.828021,7.834156,0.165591,...,1.027548,0.076768,0.087273,14.936000,11.602909,1.030182,0.402020,0.441818,0.105987,21595.725911
std,23752.338269,9224.200609,8618.584060,9309.846140,1349.478273,783.185073,604.814818,10.907756,16.468028,1.057105,...,4.386296,0.634503,0.671649,71.216021,54.253090,4.467843,1.446568,1.528223,0.427363,32591.418387
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,0.000000,865.000000,2078.250000,17.000000,15.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,4638.000000
50%,518.000000,0.000000,3059.000000,5122.000000,121.000000,125.000000,0.000000,0.000000,1.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,12399.000000
75%,4272.000000,0.000000,7280.000000,10380.750000,354.000000,301.000000,0.000000,5.000000,8.000000,0.000000,...,0.000000,0.000000,0.000000,2.000000,4.000000,0.000000,0.000000,0.000000,0.000000,25453.000000
max,522188.000000,116681.000000,107224.000000,108058.000000,77929.000000,38907.000000,28083.000000,164.000000,269.000000,49.000000,...,64.000000,12.000000,12.000000,1017.000000,777.000000,71.000000,28.000000,17.000000,4.000000,541978.000000

In [7]:
gun_totals = df_gun[['state', 'totals']]

In [8]:
gun_totals_group = gun_totals.groupby(by=['state']).sum();

In [9]:
gun_totals_group.head(5)

              totals
state
Alabama      6706079
Alaska       1137643
Arizona      4425714
Arkansas     3752633
California  19014063

### Transpose Data set to match other data set

In [10]:
gun_totals_group = gun_totals_group.T

In [11]:
gun_totals_group.head(5)

state,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,District of Columbia,Florida,...,Tennessee,Texas,Utah,Vermont,Virgin Islands,Virginia,Washington,West Virginia,Wisconsin,Wyoming
totals,6706079,1137643,4425714,3752633,19014063,6058482,3168126,491369,5601,11695777,...,7311293,19435186,4338273,484447,15108,5878675,6384517,3208889,5131725,894306

## Set up 2nd data set

In [12]:
df_census = pd.read_csv('US_Census_Data.csv')

In [13]:
df_census.head(5)

,Fact,Fact Note,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
0,"Population estimates, July 1, 2016, (V2016)",NaN,"4,863,300","741,894","6,931,071","2,988,248","39,250,017","5,540,545","3,576,452","952,065",...,865454,6651194,"27,862,596","3,051,217","624,594","8,411,808","7,288,000","1,831,102","5,778,708","585,501"
1,"Population estimates base, April 1, 2010, (V2...",NaN,"4,780,131","710,249","6,392,301","2,916,025","37,254,522","5,029,324","3,574,114","897,936",...,814195,6346298,"25,146,100","2,763,888","625,741","8,001,041","6,724,545","1,853,011","5,687,289","563,767"
2,"Population, percent change - April 1, 2010 (es...",NaN,1.70%,4.50%,8.40%,2.50%,5.40%,10.20%,0.10%,6.00%,...,0.063,0.048,10.80%,10.40%,-0.20%,5.10%,8.40%,-1.20%,1.60%,3.90%
3,"Population, Census, April 1, 2010",NaN,"4,779,736","710,231","6,392,017","2,915,918","37,253,956","5,029,196","3,574,097","897,934",...,814180,6346105,"25,145,561","2,763,885","625,741","8,001,024","6,724,540","1,852,994","5,686,986","563,626"
4,"Persons under 5 years, percent, July 1, 2016, ...",NaN,6.00%,7.30%,6.30%,6.40%,6.30%,6.10%,5.20%,5.80%,...,0.071,0.061,7.20%,8.30%,4.90%,6.10%,6.20%,5.50%,5.80%,6.50%

In [14]:
df_census.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85 entries, 0 to 84
Data columns (total 52 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Fact            80 non-null     object
 1   Fact Note       28 non-null     object
 2   Alabama         65 non-null     object
 3   Alaska          65 non-null     object
 4   Arizona         65 non-null     object
 5   Arkansas        65 non-null     object
 6   California      65 non-null     object
 7   Colorado        65 non-null     object
 8   Connecticut     65 non-null     object
 9   Delaware        65 non-null     object
 10  Florida         65 non-null     object
 11  Georgia         65 non-null     object
 12  Hawaii          65 non-null     object
 13  Idaho           65 non-null     object
 14  Illinois        65 non-null     object
 15  Indiana         65 non-null     object
 16  Iowa            65 non-null     object
 17  Kansas          65 non-null     object
 18  Kentucky        65 non-null     object
 19  Louisiana       65 non-null     object
 20  Maine           65 non-null     object
 21  Maryland        65 non-null     object
 22  Massachusetts   65 non-null     object
 23  Michigan        65 non-null     object
 24  Minnesota       65 non-null     object
 25  Mississippi     65 non-null     object
 26  Missouri        65 non-null     object
 27  Montana         65 non-null     object
 28  Nebraska        65 non-null     object
 29  Nevada          65 non-null     object
 30  New Hampshire   65 non-null     object
 31  New Jersey      65 non-null     object
 32  New Mexico      65 non-null     object
 33  New York        65 non-null     object
 34  North Carolina  65 non-null     object
 35  North Dakota    65 non-null     object
 36  Ohio            65 non-null     object
 37  Oklahoma        65 non-null     object
 38  Oregon          65 non-null     object
 39  Pennsylvania    65 non-null     object
 40  Rhode Island    65 non-null     object
 41  South Carolina  65 non-null     object
 42  South Dakota    65 non-null     object
 43  Tennessee       65 non-null     object
 44  Texas           65 non-null     object
 45  Utah            65 non-null     object
 46  Vermont         65 non-null     object
 47  Virginia        65 non-null     object
 48  Washington      65 non-null     object
 49  West Virginia   65 non-null     object
 50  Wisconsin       65 non-null     object
 51  Wyoming         65 non-null     object
dtypes: object(52)
memory usage: 34.7+ KB

In [15]:
df_census.describe()

,Fact,Fact Note,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
count,80,28,65,65,65,65,65,65,65,65,...,65,65,65,65,65,65,65,65,65,65
unique,80,15,65,64,64,64,63,64,63,64,...,65,64,64,64,63,65,65,64,65,64
top,"Population estimates, July 1, 2016, (V2016)",(c),"4,863,300",7.30%,50.30%,50.90%,6.80%,3.30%,0.10%,51.60%,...,865454,0.048,50.40%,2.50%,1.90%,"8,411,808","7,288,000",1.50%,"5,778,708",7.10%
freq,1,6,1,2,2,2,2,2,2,2,...,1,2,2,2,2,1,1,2,1,2

In [16]:
df_census.shape

(85, 52)

In [17]:
df_census_median_household_income = df_census.iloc[[47]]

In [18]:
df_census_median_household_income

,Fact,Fact Note,Alabama,Alaska,Arizona,Arkansas,California,Colorado,Connecticut,Delaware,...,South Dakota,Tennessee,Texas,Utah,Vermont,Virginia,Washington,West Virginia,Wisconsin,Wyoming
47,"Median household income (in 2015 dollars), 201...",NaN,"$43,623","$72,515","$50,255","$41,371","$61,818","$60,629","$70,331","$60,509",...,50957,45219,"$53,207","$60,727","$55,176","$65,015","$61,062","$41,751","$53,357","$58,840"

## Merge the data sets together

In [19]:
# check shape of gun ds
gun_totals_group.shape

(1, 55)

In [20]:
# check shape of census ds
df_census_median_household_income.shape

(1, 52)

In [21]:
# check info of both sets
gun_totals_group.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, totals to totals
Data columns (total 55 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Alabama               1 non-null      int64
 1   Alaska                1 non-null      int64
 2   Arizona               1 non-null      int64
 3   Arkansas              1 non-null      int64
 4   California            1 non-null      int64
 5   Colorado              1 non-null      int64
 6   Connecticut           1 non-null      int64
 7   Delaware              1 non-null      int64
 8   District of Columbia  1 non-null      int64
 9   Florida               1 non-null      int64
 10  Georgia               1 non-null      int64
 11  Guam                  1 non-null      int64
 12  Hawaii                1 non-null      int64
 13  Idaho                 1 non-null      int64
 14  Illinois              1 non-null      int64
 15  Indiana               1 non-null      int64
 16  Iowa                  1 non-null      int64
 17  Kansas                1 non-null      int64
 18  Kentucky              1 non-null      int64
 19  Louisiana             1 non-null      int64
 20  Maine                 1 non-null      int64
 21  Mariana Islands       1 non-null      int64
 22  Maryland              1 non-null      int64
 23  Massachusetts         1 non-null      int64
 24  Michigan              1 non-null      int64
 25  Minnesota             1 non-null      int64
 26  Mississippi           1 non-null      int64
 27  Missouri              1 non-null      int64
 28  Montana               1 non-null      int64
 29  Nebraska              1 non-null      int64
 30  Nevada                1 non-null      int64
 31  New Hampshire         1 non-null      int64
 32  New Jersey            1 non-null      int64
 33  New Mexico            1 non-null      int64
 34  New York              1 non-null      int64
 35  North Carolina        1 non-null      int64
 36  North Dakota          1 non-null      int64
 37  Ohio                  1 non-null      int64
 38  Oklahoma              1 non-null      int64
 39  Oregon                1 non-null      int64
 40  Pennsylvania          1 non-null      int64
 41  Puerto Rico           1 non-null      int64
 42  Rhode Island          1 non-null      int64
 43  South Carolina        1 non-null      int64
 44  South Dakota          1 non-null      int64
 45  Tennessee             1 non-null      int64
 46  Texas                 1 non-null      int64
 47  Utah                  1 non-null      int64
 48  Vermont               1 non-null      int64
 49  Virgin Islands        1 non-null      int64
 50  Virginia              1 non-null      int64
 51  Washington            1 non-null      int64
 52  West Virginia         1 non-null      int64
 53  Wisconsin             1 non-null      int64
 54  Wyoming               1 non-null      int64
dtypes: int64(55)
memory usage: 556.0+ bytes

In [22]:
# need to drop columns from the gun ds
gun_totals_group = gun_totals_group.drop(columns=['District of Columbia', 'Guam', 'Mariana Islands', 'Puerto Rico', 'Virgin Islands'])

In [23]:
gun_totals_group.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1 entries, totals to totals
Data columns (total 50 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Alabama         1 non-null      int64
 1   Alaska          1 non-null      int64
 2   Arizona         1 non-null      int64
 3   Arkansas        1 non-null      int64
 4   California      1 non-null      int64
 5   Colorado        1 non-null      int64
 6   Connecticut     1 non-null      int64
 7   Delaware        1 non-null      int64
 8   Florida         1 non-null      int64
 9   Georgia         1 non-null      int64
 10  Hawaii          1 non-null      int64
 11  Idaho           1 non-null      int64
 12  Illinois        1 non-null      int64
 13  Indiana         1 non-null      int64
 14  Iowa            1 non-null      int64
 15  Kansas          1 non-null      int64
 16  Kentucky        1 non-null      int64
 17  Louisiana       1 non-null      int64
 18  Maine           1 non-null      int64
 19  Maryland        1 non-null      int64
 20  Massachusetts   1 non-null      int64
 21  Michigan        1 non-null      int64
 22  Minnesota       1 non-null      int64
 23  Mississippi     1 non-null      int64
 24  Missouri        1 non-null      int64
 25  Montana         1 non-null      int64
 26  Nebraska        1 non-null      int64
 27  Nevada          1 non-null      int64
 28  New Hampshire   1 non-null      int64
 29  New Jersey      1 non-null      int64
 30  New Mexico      1 non-null      int64
 31  New York        1 non-null      int64
 32  North Carolina  1 non-null      int64
 33  North Dakota    1 non-null      int64
 34  Ohio            1 non-null      int64
 35  Oklahoma        1 non-null      int64
 36  Oregon          1 non-null      int64
 37  Pennsylvania    1 non-null      int64
 38  Rhode Island    1 non-null      int64
 39  South Carolina  1 non-null      int64
 40  South Dakota    1 non-null      int64
 41  Tennessee       1 non-null      int64
 42  Texas           1 non-null      int64
 43  Utah            1 non-null      int64
 44  Vermont         1 non-null      int64
 45  Virginia        1 non-null      int64
 46  Washington      1 non-null      int64
 47  West Virginia   1 non-null      int64
 48  Wisconsin       1 non-null      int64
 49  Wyoming         1 non-null      int64
dtypes: int64(50)
memory usage: 516.0+ bytes

In [24]:
df_census_median_household_income.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 47 to 47
Data columns (total 52 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Fact            1 non-null      object
 1   Fact Note       0 non-null      object
 2   Alabama         1 non-null      object
 3   Alaska          1 non-null      object
 4   Arizona         1 non-null      object
 5   Arkansas        1 non-null      object
 6   California      1 non-null      object
 7   Colorado        1 non-null      object
 8   Connecticut     1 non-null      object
 9   Delaware        1 non-null      object
 10  Florida         1 non-null      object
 11  Georgia         1 non-null      object
 12  Hawaii          1 non-null      object
 13  Idaho           1 non-null      object
 14  Illinois        1 non-null      object
 15  Indiana         1 non-null      object
 16  Iowa            1 non-null      object
 17  Kansas          1 non-null      object
 18  Kentucky        1 non-null      object
 19  Louisiana       1 non-null      object
 20  Maine           1 non-null      object
 21  Maryland        1 non-null      object
 22  Massachusetts   1 non-null      object
 23  Michigan        1 non-null      object
 24  Minnesota       1 non-null      object
 25  Mississippi     1 non-null      object
 26  Missouri        1 non-null      object
 27  Montana         1 non-null      object
 28  Nebraska        1 non-null      object
 29  Nevada          1 non-null      object
 30  New Hampshire   1 non-null      object
 31  New Jersey      1 non-null      object
 32  New Mexico      1 non-null      object
 33  New York        1 non-null      object
 34  North Carolina  1 non-null      object
 35  North Dakota    1 non-null      object
 36  Ohio            1 non-null      object
 37  Oklahoma        1 non-null      object
 38  Oregon          1 non-null      object
 39  Pennsylvania    1 non-null      object
 40  Rhode Island    1 non-null      object
 41  South Carolina  1 non-null      object
 42  South Dakota    1 non-null      object
 43  Tennessee       1 non-null      object
 44  Texas           1 non-null      object
 45  Utah            1 non-null      object
 46  Vermont         1 non-null      object
 47  Virginia        1 non-null      object
 48  Washington      1 non-null      object
 49  West Virginia   1 non-null      object
 50  Wisconsin       1 non-null      object
 51  Wyoming         1 non-null      object
dtypes: object(52)
memory usage: 424.0+ bytes

In [25]:
# need to drop columns from the 2nd table to match the 1st
df_census_median_household_income = df_census_median_household_income.drop(columns=['Fact', 'Fact Note'])

In [26]:
df_census_median_household_income.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 47 to 47
Data columns (total 50 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Alabama         1 non-null      object
 1   Alaska          1 non-null      object
 2   Arizona         1 non-null      object
 3   Arkansas        1 non-null      object
 4   California      1 non-null      object
 5   Colorado        1 non-null      object
 6   Connecticut     1 non-null      object
 7   Delaware        1 non-null      object
 8   Florida         1 non-null      object
 9   Georgia         1 non-null      object
 10  Hawaii          1 non-null      object
 11  Idaho           1 non-null      object
 12  Illinois        1 non-null      object
 13  Indiana         1 non-null      object
 14  Iowa            1 non-null      object
 15  Kansas          1 non-null      object
 16  Kentucky        1 non-null      object
 17  Louisiana       1 non-null      object
 18  Maine           1 non-null      object
 19  Maryland        1 non-null      object
 20  Massachusetts   1 non-null      object
 21  Michigan        1 non-null      object
 22  Minnesota       1 non-null      object
 23  Mississippi     1 non-null      object
 24  Missouri        1 non-null      object
 25  Montana         1 non-null      object
 26  Nebraska        1 non-null      object
 27  Nevada          1 non-null      object
 28  New Hampshire   1 non-null      object
 29  New Jersey      1 non-null      object
 30  New Mexico      1 non-null      object
 31  New York        1 non-null      object
 32  North Carolina  1 non-null      object
 33  North Dakota    1 non-null      object
 34  Ohio            1 non-null      object
 35  Oklahoma        1 non-null      object
 36  Oregon          1 non-null      object
 37  Pennsylvania    1 non-null      object
 38  Rhode Island    1 non-null      object
 39  South Carolina  1 non-null      object
 40  South Dakota    1 non-null      object
 41  Tennessee       1 non-null      object
 42  Texas           1 non-null      object
 43  Utah            1 non-null      object
 44  Vermont         1 non-null      object
 45  Virginia        1 non-null      object
 46  Washington      1 non-null      object
 47  West Virginia   1 non-null      object
 48  Wisconsin       1 non-null      object
 49  Wyoming         1 non-null      object
dtypes: object(50)
memory usage: 408.0+ bytes

In [27]:
gun_totals_group.shape

(1, 50)

In [28]:
df_census_median_household_income.shape

(1, 50)

In [29]:
# Need to transpose both tables to have 1 col with 50 rows each
gun_totals_group = gun_totals_group.T
df_census_median_household_income = df_census_median_household_income.T

In [30]:
gun_totals_group.shape

(50, 1)

In [31]:
df_census_median_household_income.shape

(50, 1)

In [32]:
df_census_median_household_income.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, Alabama to Wyoming
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   47      50 non-null     object
dtypes: object(1)
memory usage: 2.8+ KB

In [33]:
gun_totals_group = gun_totals_group.rename(columns={'totals': 'bgChecks'})
gun_totals_group.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, Alabama to Wyoming
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   bgChecks  50 non-null     int64
dtypes: int64(1)
memory usage: 2.8+ KB

In [34]:
gun_totals_group.head()

            bgChecks
state
Alabama      6706079
Alaska       1137643
Arizona      4425714
Arkansas     3752633
California  19014063

In [35]:
df_census_median_household_income.head()

                  47
Alabama     $43,623
Alaska      $72,515
Arizona     $50,255
Arkansas    $41,371
California  $61,818

In [36]:
df_census_median_household_income.columns

Int64Index([47], dtype='int64')

In [37]:
df_census_median_household_income = df_census_median_household_income.reset_index()

In [38]:
df_census_median_household_income.columns

Index(['index', 47], dtype='object')

In [39]:
df_census_median_household_income = df_census_median_household_income.rename(columns={'index': 'state', 47: 'income'})

In [40]:
df_census_median_household_income.columns

Index(['state', 'income'], dtype='object')

In [41]:
df_census_gun = gun_totals_group.merge(df_census_median_household_income, how='inner', on='state')

In [42]:
df_census_gun = df_census_gun.loc[:, ['state', 'bgChecks', 'income']]

In [43]:
df_census_gun['income'] = (
    df_census_gun['income'].astype(str).str.replace(r'[^\d,]', '', regex=True))

In [44]:
df_census_gun['income'] = (
    df_census_gun['income'].str.replace(',', '').astype(int))

In [45]:
df_census_gun['income'] = df_census_gun['income'].apply(lambda x: f"${x:,.0f}")

In [46]:
df_census_gun.style.format({'bgChecks': '{:,}'})